mtfurlan/ch559-usb-host/ch559/src/uart.c

#include "uart.h"
#include "CH559.h"
#include "util.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

uint8_t __xdata uartRxBuff[64];
uint8_t __xdata rxPos = 0;


void processUart()
{
    while (RI) {
        RI = 0;
        uartRxBuff[rxPos] = SBUF;
        if (uartRxBuff[rxPos] == '\n' || rxPos >= 64) {
            for (uint8_t i = 0; i < rxPos; i++) {
                printf("0x%02X ", uartRxBuff[i]);
            }
            printf("\n");
            if (uartRxBuff[0] == 'k') {
                //if(uartRxBuff[1]==0x61)LED=0;
                //if(uartRxBuff[1]==0x73)LED=1;
                if (uartRxBuff[1] == 'b')
                    runBootloader();
            }
            rxPos = 0;
        } else {
            rxPos++;
        }
    }
}

void sendProtocolMSG(unsigned char msgtype,
                     unsigned short length,
                     unsigned char type,
                     unsigned char device,
                     unsigned char endpoint,
                     unsigned char __xdata* msgbuffer)
{
    unsigned short i;
    putchar(0xFE);
    putchar(length);
    putchar((unsigned char)(length >> 8));
    putchar(msgtype);
    putchar(type);
    putchar(device);
    putchar(endpoint);
    putchar(0);
    putchar(0);
    putchar(0);
    putchar(0);
    for (i = 0; i < length; i++) {
        putchar(msgbuffer[i]);
    }
    putchar('\n');
}

void sendHidPollMSG(unsigned char msgtype,
                    unsigned short length,
                    unsigned char type,
                    unsigned char device,
                    unsigned char endpoint,
                    unsigned char __xdata* msgbuffer,
                    unsigned char idVendorL,
                    unsigned char idVendorH,
                    unsigned char idProductL,
                    unsigned char idProductH)
{
    unsigned short i;
    putchar(0xFE);
    putchar(length);
    putchar((unsigned char)(length >> 8));
    putchar(msgtype);
    putchar(type);
    putchar(device);
    putchar(endpoint);
    putchar(idVendorL);
    putchar(idVendorH);
    putchar(idProductL);
    putchar(idProductH);
    for (i = 0; i < length; i++) {
        putchar(msgbuffer[i]);
    }
    putchar('\n');
}